[
    {
        "title": "Senior Software Engineer",
        "company": "Neudesic, Inc.",
        "location": "",
        "date": "May 2022 – Present",
        "highlights": [
            "Developed and delivered over 10 AI solutions resulting in a 20% increase in client operational efficiency and decrease in cost.",
            "Architected and implemented scalable cloud applications on Azure, reducing infrastructure costs by 25% and accelerating deployment cycles for enterprise clients.",
            "Drove adoption of AI and developer productivity tools (including GitHub Copilot), training 100+ engineers and improving code delivery speed by 20% through tailored workshops and process automation.",
            "Mentored and led cross-functional teams, fostering a culture of innovation and continuous improvement that resulted in a 95% client satisfaction rate and multiple successful proof-of-concept deliveries."
        ]
    },
    {
        "title": "Owner / Founder",
        "company": "Pines Cabin Rentals",
        "location": "Big Bear, CA",
        "date": "Jan 2019 – May 2022",
        "highlights": [
            "Managed operations for over 20 vacation rental properties, maintaining a 5-star Airbnb rating with 100+ guest reviews.",
            "Designed and developed a custom React and Node.js website to streamline bookings, customer communication, and property management.",
            "Integrated payment processing, calendar sync, and automated notifications to enhance guest experience and operational efficiency.",
            "Increased bookings by an average of 3 sales per cabin annually through improved online presence and direct booking capabilities."
        ]
    },
    {
        "title": "IT and Web Development",
        "company": "Del Sol School (Non-Profit)",
        "location": "",
        "date": "Nov 2016 – Jan 2019",
        "highlights": [
            "Built and maintained the school's WordPress website, ensuring up-to-date content and reliable performance.",
            "Set up, repaired, and maintained computers and network infrastructure for 20 staff and 40 students across the campus.",
            "Provided ongoing technical support, resolving hardware, software, and connectivity issues to keep school operations running smoothly."
        ]
    }
]